app/views/sub_categories/_category_filter.html.erb

<div class="filter-wrapper">
  <%= link_to(category.sub_categories.first, class: 'category-link no-underline')  do %>
---
SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1  ORDER BY "sub_categories"."id" ASC LIMIT 1  [["category_id", 1]]