app/views/layouts/_header.html.erb

        <li><%= link_to "Social Feed", search_index_path %></li>
        <% default_cat = SubCategory.find_by(name: "Surfboards") %>
        <% if default_cat == nil %>
        <%  default_cat = SubCategory.first %>
---
SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."name" = $1 LIMIT 1  [["name", "Surfboards"]]
SELECT  "sub_categories".* FROM "sub_categories"  ORDER BY "sub_categories"."id" ASC LIMIT 1